[toc]

## 1 定义

使用预定义的约定指定自定义日期时间格式。以下约定可供选择：
* “y”：将年份指定为“yy”（例如：90、20）或“yyyy”（全写，例如：1990、2020）。
* “M”：将月份指定为“M”（例如：1、2）、“MM”（例如：01、02）、“MMM”（月份的缩写名称，例如：Jan、Feb）或“MMMM”（月份的全称，例如：January、February）。
* “d”：以“d”或“dd”格式指月中的某天。
* “D”：以“D”或“DD”格式指年中的某天。
* “E”：指定一周的某天为“EEE”(Sun-Sat) 或“EEEE”(Sunday-Saturday)。
* “h”：将小时指定为“h”或“hh”，十二小时制。
* “H”：将小时指定为“H”或“HH”，二十四小时制。
* “a”：为12小时时间格式指定AM/PM标记。
* “m”：以“mm”形式指定分钟。
* “s”：以“ss”形式指定秒数。
* “S”：将毫秒指定为“SSS”。
* “z”：指定时区，例如“太平洋标准时间”和“印度标准时间”。
* “Z”：指定时区的时差，例如“+0550”表示“印度标准时间”。
* “T”：表示分隔符。

## 2 示例

* > yyyy-MM-dd HH:mm:ss 
    > 2022-01-01 10:10:59
* > yyyy-MM-dd HH:mm:ss.SSS
    > 2022-01-01 10:10:59.656
* > yyyy-MM-dd HH:mm:ss.SSS Z
    > 2022-01-01 10:10:59.656 +0800
* > yyyy-MM-dd hh:mm:ss.SSS a
    > 2022-01-01 10:10:59.656 AM
* > yyyy-MM-dd'T'HH:mm:ss.SSS Z
    > 2022-01-01T10:10:59.656 +0800
* > EEE, dd MMM yyyy HH:mm:ss z
    > Sun, 16 Oct 2023 10:10:59 CST







